# বেসিক পরিসংখ্যান

প্রথমে প্রয়োজনীয় লাইব্রেরী ইমপোর্ট করে নেব।

In [1]:
import numpy as np
import pandas as pd

কাজ করা জন্য প্রথমে আমাদের ডাটা লাগবে। তাহলে দেখে নেই কিভাবে আমারা ডাটা সংযুক্ত করব। দুই ভাবে রিড করা দেখাচ্ছি.. প্রথমে URL থেকে। পরে Directory থেকে।

# URL থেকে ডাটা রিড

In [2]:
url = "https://github.com/shaidazmin/DataScience/blob/main/3.%20Statistics/GPA.csv?raw=true" # don't forget to add -> ?raw=true

In [3]:
data = pd.read_csv(url, index_col=0)

In [4]:
data.head()

       StudyTime  GamingHour   GPA
Name
Monir        4.0         0.5  3.55
Jony         2.5         1.0  2.35
Gopal        3.0         0.5  3.07
Habib        6.0         0.0  3.93
Kona         5.0         0.5  3.97

# Computer Directory থেকে ডাটা রিড

ডেটা যদি একই Directory তে থাকে তাহলে এভাবে রিড করব

In [5]:
data = pd.read_csv(r"GPA.csv")

ডেটা যদি অন্য Directory তে থাকে তাহলে এভাবে রিড করব

In [6]:
data = pd.read_csv(r"C:\Users\Shaid Azmin\Desktop\Data Science\FullRoadMapDataScience\3. Statistics\GPA.csv")

In [7]:
data.head()

    Name  StudyTime  GamingHour   GPA
0  Monir        4.0         0.5  3.55
1   Jony        2.5         1.0  2.35
2  Gopal        3.0         0.5  3.07
3  Habib        6.0         0.0  3.93
4   Kona        5.0         0.5  3.97

#### Problem - 1. ডেটাসেট রিড করে (10 জন শিক্ষার্থীর নাম, স্টাডি টাইম, গেমি আওয়ার এবং জিপিএ  বের করি...)

In [8]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

#### Problem - 2. কাউন্ট ফাংশনের ব্যাহার

In [9]:
data.count()

Name          10
StudyTime     10
GamingHour    10
GPA           10
dtype: int64

#### Problem - 3. কোন কলামের সকল ভেলু যোগ করা

In [10]:
data.head(1)

    Name  StudyTime  GamingHour   GPA
0  Monir        4.0         0.5  3.55

In [11]:
data["StudyTime"].sum()

32.5

In [12]:
data.GPA.sum()

32.36

In [13]:
data['GamingHour'].sum()

9.0

#### Problem - 4. কিউমিলেটিভ সামের ব্যবহার

In [14]:
data.head(2)

    Name  StudyTime  GamingHour   GPA
0  Monir        4.0         0.5  3.55
1   Jony        2.5         1.0  2.35

In [15]:
data.Name.cumsum()

0                                               Monir
1                                           MonirJony
2                                      MonirJonyGopal
3                                 MonirJonyGopalHabib
4                             MonirJonyGopalHabibKona
5                        MonirJonyGopalHabibKonaBablu
6                    MonirJonyGopalHabibKonaBabluSara
7               MonirJonyGopalHabibKonaBabluSaraJaved
8          MonirJonyGopalHabibKonaBabluSaraJavedHasib
9    MonirJonyGopalHabibKonaBabluSaraJavedHasibHridoy
Name: Name, dtype: object

In [16]:
data.StudyTime

0    4.0
1    2.5
2    3.0
3    6.0
4    5.0
5    1.0
6    3.5
7    4.0
8    2.0
9    1.5
Name: StudyTime, dtype: float64

In [17]:
data.StudyTime.cumsum()

0     4.0
1     6.5
2     9.5
3    15.5
4    20.5
5    21.5
6    25.0
7    29.0
8    31.0
9    32.5
Name: StudyTime, dtype: float64

#### Problem - 5. মিন ফাংশনের ব্যবহর

In [18]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [19]:
data.mean()

StudyTime     3.250
GamingHour    0.900
GPA           3.236
dtype: float64

#### Problem - 6. মিডিয়ান ফাংশনের ব্যবহর

In [20]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [21]:
data.median()

StudyTime     3.25
GamingHour    0.50
GPA           3.31
dtype: float64

#### Problem -7. মোড ফাংশনের ব্যবহর

In [22]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [23]:
data.StudyTime.mode()

0    4.0
dtype: float64

In [24]:
data.GamingHour.mode()

0    0.5
dtype: float64

In [25]:
data.GPA.mode()

0    2.35
1    2.43
2    2.81
3    2.97
4    3.07
5    3.55
6    3.61
7    3.67
8    3.93
9    3.97
dtype: float64

#### Problem - 8. ম্যাক্সিমাম ও মিনিমাম নির্ণয়

In [26]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [27]:
data.min()

Name          Bablu
StudyTime         1
GamingHour        0
GPA            2.35
dtype: object

In [28]:
data.max()

Name          Sara
StudyTime        6
GamingHour       3
GPA           3.97
dtype: object

#### Problem - 9. রেঞ্জ নির্ণয়

In [29]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [30]:
range = data[["StudyTime", "GamingHour", "GPA"]].max() - data[["StudyTime", "GamingHour", "GPA"]].min()
range

StudyTime     5.00
GamingHour    3.00
GPA           1.62
dtype: float64

#### Problem - 10. ভ্যারিয়্যান্স নির্ণয়

In [31]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [32]:
data.var()

StudyTime     2.458333
GamingHour    0.877778
GPA           0.351293
dtype: float64

#### Problem - 11 স্ট্যান্ডার্ড ডেভিয়েশন নির্ণয়

In [33]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [34]:
data.std()

StudyTime     1.567907
GamingHour    0.936898
GPA           0.592700
dtype: float64

#### Problem - 12. কোভ্যারিয়্যান্স ম্যাট্রিক্স

In [35]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [36]:
data.cov()

            StudyTime  GamingHour       GPA
StudyTime    2.458333   -1.194444  0.827222
GamingHour  -1.194444    0.877778 -0.418222
GPA          0.827222   -0.418222  0.351293

#### Problem 13. স্কিউনেস এবং কার্টোসিস নির্ণয়

In [37]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [38]:
data.skew()

StudyTime     0.283764
GamingHour    1.499697
GPA          -0.283563
dtype: float64

In [39]:
data.kurtosis()

StudyTime    -0.548118
GamingHour    1.985173
GPA          -1.396490
dtype: float64

#### Problem 15. কোয়ান্টাইলস এবং ইন্টার কোয়ান্টাইল রেঞ্জ নির্ণয়

In [40]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [41]:
data.quantile(.25)

StudyTime     2.125
GamingHour    0.500
GPA           2.850
Name: 0.25, dtype: float64

In [42]:
data.quantile(.75) - data.quantile(.25)

StudyTime     1.875
GamingHour    0.500
GPA           0.805
dtype: float64

#### Problem - 16. ডেস্ক্রাইব ফাংশনের ব্যবহার

In [43]:
data

     Name  StudyTime  GamingHour   GPA
0   Monir        4.0         0.5  3.55
1    Jony        2.5         1.0  2.35
2   Gopal        3.0         0.5  3.07
3   Habib        6.0         0.0  3.93
4    Kona        5.0         0.5  3.97
5   Bablu        1.0         3.0  2.43
6    Sara        3.5         0.0  3.61
7   Javed        4.0         0.5  3.67
8   Hasib        2.0         1.0  2.97
9  Hridoy        1.5         2.0  2.81

In [44]:
data.describe()

       StudyTime  GamingHour      GPA
count  10.000000   10.000000  10.0000
mean    3.250000    0.900000   3.2360
std     1.567907    0.936898   0.5927
min     1.000000    0.000000   2.3500
25%     2.125000    0.500000   2.8500
50%     3.250000    0.500000   3.3100
75%     4.000000    1.000000   3.6550
max     6.000000    3.000000   3.9700

In [45]:
data.describe(include='all')

        Name  StudyTime  GamingHour      GPA
count     10  10.000000   10.000000  10.0000
unique    10        NaN         NaN      NaN
top     Kona        NaN         NaN      NaN
freq       1        NaN         NaN      NaN
mean     NaN   3.250000    0.900000   3.2360
std      NaN   1.567907    0.936898   0.5927
min      NaN   1.000000    0.000000   2.3500
25%      NaN   2.125000    0.500000   2.8500
50%      NaN   3.250000    0.500000   3.3100
75%      NaN   4.000000    1.000000   3.6550
max      NaN   6.000000    3.000000   3.9700